In [2]:
import pandas as pd

#### Задание 1

Используйте файл с оценками фильмов ml-latest-small/ratings.csv. Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId.

In [3]:
df_rat = pd.read_csv("ml-latest-small/ratings.csv")

In [4]:
def count_rating_and_timestamp(row):
    row["ratingCount"] = row.rating.count()
    row["lifeTime"] = row.timestamp.max() - row.timestamp.min()
    return row

data = df_rat.groupby("userId").apply(count_rating_and_timestamp)[["ratingCount", "lifeTime"]].drop_duplicates()
round(data.loc[data.ratingCount > 100].lifeTime.mean(), 2)

40080507.45

#### Задание 2

Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия). Необходимо сформировать две таблицы:
- таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
- аналогичную таблицу по типам выручки с указанием адреса клиента

Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

- rzd - железнодорожные перевозки
- auto - автомобильные перевозки
- air - воздушные перевозки
- client_base - адреса клиентов

In [5]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [6]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [7]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [8]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [9]:
# таблица с тремя типами перевозок 

svod = (
    client_base.merge(rzd, on="client_id", how="left").
    merge(auto, on="client_id", how="left").
    merge(air, on="client_id", how="left")
)

# с адресом
svod

   client_id          address  rzd_revenue  auto_revenue  air_revenue
0        111  Комсомольская 4       1093.0           NaN          NaN
1        112   Энтузиастов 8а       2810.0           NaN          NaN
2        113  Левобережная 1а      10283.0       57483.0          NaN
3        114          Мира 14       5774.0          83.0          NaN
4        115        ЗЖБИиДК 1        981.0         912.0         81.0
5        116    Строителей 18          NaN        4834.0          4.0
6        117  Панфиловская 33          NaN          98.0         13.0
7        118     Мастеркова 4          NaN           NaN        173.0

In [10]:
# без адреса 

svod.drop("address", axis=1)

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

#### Задание 3

В задаче сквозной аналитики вам предоставили данные по местоположению пользователей. Т. е. для каждого user_id известна последовательность координат (широта/долгота), когда они требовались приложению для полноценной работы. Как бы вы добавили эти сведения в таблицу визитов и покупок? Для составления ответа можно использовать вопросы:
- У каждого пользователя известен набор координат. А для связывания с визитом или фактом покупки скорее всего потребуется одно-два числа. Как их получить?
- Наборы координат одного и того же пользователя могут быть значительно удалены друг от друга. Как это отразится на вопросе расчетах пункта 1?
- Какие дополнительные признаки можно получить из координат? Ведь это просто числа, которые сами по себе мало что дают.

#### Ответ

- Предположим, что по хронологии каждая пара координат из набора соответствует определнному взаимодействию пользователя с приложением (просмотр или покупка). то есть датафрейм с визитами отсортирован в хронологическом порядке, и данные в массиве координат пользователя отсортированы так же.

In [11]:
#Мы создадим датафрейм с координатами, формата

df = pd.DataFrame(
    {
        'user_id': [1, 1, 1, 2, 2, 3],
        'coordinates': ["55,755831°, 37,617673°", "55,755831°, 37,617673°", "55,755831°, 37,617673°",
                        "55,755831°, 37,617673°", "55,755831°, 37,617673°", "55,755831°, 37,617673°"]
    }
)
df

   user_id             coordinates
0        1  55,755831°, 37,617673°
1        1  55,755831°, 37,617673°
2        1  55,755831°, 37,617673°
3        2  55,755831°, 37,617673°
4        2  55,755831°, 37,617673°
5        3  55,755831°, 37,617673°

Затем мы соединим по user_id фрейм с коррдинатами и с покупками - получим координаты каждого взаимодействия

- По идее вообще не должно отразиться на расчетах - только на конечной аналитике

- Мы можем понять, где находился пользователь, запрашивая определенную вещь - можем сложить впечатление об интересах пользователя. По наибольшим совпадениям координат, можем предположить, где пользователь живет и , например, таргетировать на него события или магазины его города. Так же по удаленным координатам можем понять, например, что человек был в путешествии и понять, что людям может быть интересно покупать в путешествиях и предлагать пользователю приобрести необходимые к поездке товары заранее